Repository: Dietr1ch/mlocate
Catalog: po/*.po
Languages: ru

source: warning: Line number overflow
ru: внимание: Количество строк переполнено

source: missing closing `"'
ru: ошибка закрытия `"'

source: can not open `%s'
ru: не возможно открыть `%s'

source: unknown variable `%s'
ru: не известная переменная `%s'

source: variable name expected
ru: ожидание имени переменной

source: variable `%s' was already defined
ru: переменная `%s' уже определена

source: `=' expected after variable name
ru: `=' предусмотрен после имени переменной

source: value in quotes expected after `='
ru: значение в кавычках ожидается после `='

source: invalid value `%s' of PRUNE_BIND_MOUNTS
ru: не возможное значение `%s' для PRUNE_BIND_MOUNTS

source: unexpected data after variable value
ru: неожиданные данные после значения переменной

source: I/O error reading `%s'
ru: I/O ошибка чтения `%s'

source: Usage: updatedb [OPTION]... Update a mlocate database. -f, --add-prunefs FS omit also FS -n, --add-prunenames NAMES omit also NAMES -e, --add-prunepaths PATHS omit also PATHS -U, --database-root PATH the subtree to store in database (default "/") -h, --help print this help -o, --output FILE database to update (default `%s') --prune-bind-mounts FLAG omit bind mounts (default "no") --prunefs FS filesystems to omit from database --prunenames NAMES directory names to omit from database --prunepaths PATHS paths to omit from database -l, --require-visibility FLAG check visibility before reporting files (default "yes") -v, --verbose print paths of files as they are found -V, --version print version information The configuration defaults to values read from `%s'.
ru: Использовать: updatedb [ОПЦИИ]... Обновление mlocate базы данных. -f, --add-prunefs ФС пропускать указанные ФС -n, --add-prunenames ИМЕНА пропускать ИМЕНА -e, --add-prunepaths ПУТИ пропускать ПУТИ -U, --database-root ПУТЬ поддерево хранящиеся в базе данных (по умолчанию "/") -h, --help вывести эту справку -o, --output FILE база данный для обновления (по умолчанию `%s') --prune-bind-mounts ФЛАГ пропускать примонтированные ФС(по умолчанию "нет") --prunefs ФС ФС для исключения из базы данных --prunenames ИМЕНА каталог для исключения из базы данных --prunepaths ПУТИ пути для исключения из базы данных -l, --require-visibility ФЛАГ проверить существование файлов прежде чем добавлять (по умолчанию "да") -v, --verbose печатать пути до найденных файлов -V, --version вывести информацию о версии Параметры по умолчанию считаны из `%s'.

source: Report bugs to %s.
ru: Отчёт об ошибках отправьте %s.

source: can not get current working directory
ru: не возможно получить текущую рабочую директорию

source: --%s would override earlier command-line argument
ru: --%s вероятно отменен ранним аргументом командной строки

source: invalid value `%s' of --%s
ru: неверное значение `%s' of --%s

source: --%s specified twice
ru: --%s определен дважды

source: Copyright (C) 2007 Red Hat, Inc. All rights reserved. This software is distributed under the GPL v.2. This program is provided with NO WARRANTY, to the extent permitted by law.
ru: Copyright (C) 2007 Red Hat, Inc. Все права защищены. Это программное обеспечение распространяться по лицензии GPL v.2. Эта программа распространяется БЕЗ ГАРАНТИЙ, в пределах допускаемых законом.

source: unexpected operand on command line
ru: непредвиденный операнд в командной строке

source: `%s' does not seem to be a mlocate database
ru: `%s' кажется не является базой данных mlocate

source: `%s' has unknown version %u
ru: `%s' имеет не известную версию %u

source: `%s' has unknown visibility flag %u
ru: `%s' имеет не известный видимый флаг %u

source: unexpected EOF reading `%s'
ru: неожиданный EOF чтения `%s'

source: I/O error seeking in `%s'
ru: ошибка I/O поиска в `%s'

source: Database %s:
ru: База данных %s:

source: invalid empty directory name in `%s'
ru: не действительное имя пустой директории в `%s'

source: file name length %zu in `%s' is too large
ru: длинна имени файла %zu в `%s' слишком большое

source: Usage: locate [OPTION]... [PATTERN]... Search for entries in a mlocate database. -b, --basename match only the base name of path names -c, --count only print number of found entries -d, --database DBPATH use DBPATH instead of default database (which is %s) -e, --existing only print entries for currently existing files -L, --follow follow trailing symbolic links when checking file existence (default) -h, --help print this help -i, --ignore-case ignore case distinctions when matching patterns -l, --limit, -n LIMIT limit output (or counting) to LIMIT entries -m, --mmap ignored, for backward compatibility -P, --nofollow, -H don't follow trailing symbolic links when checking file existence -0, --null separate entries with NUL on output -S, --statistics don't search for entries, print statistics about each used database -q, --quiet report no error messages about reading databases -r, --regexp REGEXP search for basic regexp REGEXP instead of patterns --regex patterns are extended regexps -s, --stdio ignored, for backward compatibility -V, --version print version information -w, --wholename match whole path name (default)
ru: Использовать: locate [ОПЦИИ]... [ОБРАЗЕЦ]... Поиск для элементов в базе данных mlocate. -b, --basename только совпадения базового имени в имени пути -c, --count печатать только число вхождений -d, --database DBPATH используйте DBPATH вместо базы данных по умолчанию (которая %s) -e, --existing печатать вхождения только для существующих в данный момент файлов -L, --follow следовать символическим ссылкам при проверке файла на существование (значение по умолчанию) -h, --help показать эту справку -i, --ignore-case игнорировать регистр найденных совпадений -l, --limit, -n LIMIT ограничить вывод (или подсчёт) LIMIT вхождениями -m, --mmap игнорируется, для обратной совместимости -P, --nofollow, -H не следовать символическим ссылкам при проверке файла на существование -0, --null разделять вхождения с выводом NUL -S, --statistics не искать вхождений, печать статистики по используемой базе данных -q, --quiet не сообщать об ошибках чтения базы данных -r, --regexp REGEXP искать по регулярному выражению REGEXP вместо шаблонов --regex шаблоны расширенных регулярных выражений -s, --stdio игнорируется, для обратной совместимости -V, --version распечатать информацию о версии -w, --wholename только целые имена пути (по умолчанию)

source: non-option arguments are not allowed with --%s
ru: не является аргументом опции или не разрешен с --%s

source: no pattern to search for specified
ru: образец для поиска не определён

source: invalid regexp `%s': %s
ru: не возможное regexp `%s': %s

source: can not drop privileges
ru: не возможно понизить привилегии

source: can not read two databases from standard input
ru: не возможно читать две базы данных из стандартного ввода

source: can not stat () `%s'
ru: не может стать () `%s'

source: I/O error while writing to standard output
ru: ошибка I/O во время записи в стандартный вывод

source: file name length %zu is too large
ru: длинна имени файла %zu очень большая

source: can not open a temporary file for `%s'
ru: не возможно открыть временный файл для `%s'

source: configuration is too large
ru: конфигурация очень большая

source: can not find group `%s'
ru: не возможно найти группу `%s'

source: can not change group of file `%s' to `%s'
ru: не возможно изменить группу файла с `%s' на `%s'

source: can not change permissions of file `%s'
ru: не возможно изменить права файла `%s'

source: `%s' is locked (probably by an earlier updatedb)
ru: `%s' заблокирован (возможно более ранним updatedb)

source: can not lock `%s'
ru: не возможно заблокировать `%s'

source: can not change directory to `%s'
ru: не возможно изменить на директорию `%s'

source: I/O error while writing to `%s'
ru: ошибка I/O во время записи в `%s'

source: error replacing `%s'
ru: ошибка замены `%s'
